EDT/УТ/src/DataProcessors/ЗагрузкаВЯндексOauth/ЗагрузкаВЯндексOauth.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаВЯндексOauth</name>
  <attributes>
    <name>Дата</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ИмяСеревера</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ПрефиксСервиса</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>РазмерПорцииДанных</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СерверСБалансером</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:DataProcessor>

EDT/УТ/src/InformationRegisters/ПривязкаМашинКРейсам/ПривязкаМашинКРейсам.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПривязкаМашинКРейсам</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <resources>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </resources>
  <resources>
    <name>Водитель</name>
    <type>
      <types>CatalogRef.новаВодители</types>
    </type>
  </resources>
  <resources>
    <name>Экспедитор</name>
    <type>
      <types>CatalogRef.новаЭкспедиторы</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанВодитель</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтвязанЭкспедитор</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <attributes>
    <name>КтоПривязал</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>АвтоматическаяПривязка</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>Рейс</name>
    <type>
      <types>DocumentRef.Рейс</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ТелефонныеАппаратыТранспорта/ТелефонныеАппаратыТранспорта.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ТелефонныеАппаратыТранспорта</name>
  <informationRegisterPeriodicity>Second</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources>
    <name>ТА</name>
    <type>
      <types>CatalogRef.ТелефонныеАппараты</types>
    </type>
  </resources>
  <dimensions>
    <name>Транспорт</name>
    <type>
      <types>CatalogRef.новаТранспорт</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/ДополнительныеПараметрыЗаказа/ДополнительныеПараметрыЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ДополнительныеПараметрыЗаказа</name>
  <resources>
    <name>ОценочнаяСтоимость</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентом</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СкладМагазина</name>
    <type>
      <types>CatalogRef.СкладыМагазинов</types>
    </type>
  </resources>
  <resources>
    <name>ПричинаОтклоненияЗаказа</name>
    <type>
      <types>CatalogRef.ПричиныОтклоненияЗаказаВСистеме</types>
    </type>
  </resources>
  <resources>
    <name>ЧастичныйВыкупЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>СОжиданием</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>КОплатеКлиентомИзмененное</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>okey</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаОтгрузки</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ШтрихкодOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>30</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>nameOZON</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ВозвратЗапрещен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодъемОплачен</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>РасстояниеОтБазыПоДорогам</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП</name>
    <type>
      <types>CatalogRef.КатегорииДоставки2014</types>
    </type>
  </resources>
  <resources>
    <name>ПравилоСопоставленияКатегории</name>
    <type>
      <types>CatalogRef.ПравилаСопоставленияКатегорийЗаказовДляРасчетаЗП</types>
    </type>
  </resources>
  <resources>
    <name>ПредварительноеЗакрытие</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ДополнительныйНомерЗаказа</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СтавкаНДСФЗПоДоставке</name>
    <type>
      <types>CatalogRef.СтавкиНДСФЗ54</types>
    </type>
  </resources>
  <resources>
    <name>EmailКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>МетодОплатыПодъемаЗаказа</name>
    <type>
      <types>EnumRef.МетодыОплатыПодъёмаЗаказа</types>
    </type>
  </resources>
  <resources>
    <name>ТарифнаяСеткаПодъемаЗаказов</name>
    <type>
      <types>CatalogRef.ТарифыПодъемаЗаказовНаЭтаж</types>
    </type>
  </resources>
  <resources>
    <name>КатегорияДляРасчетаЗП_Миго</name>
    <type>
      <types>CatalogRef.мгКатегорииЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>СхемаЛогистическихБрейков</name>
    <type>
      <types>CatalogRef.СхемыЛогистическихБрейков</types>
    </type>
  </resources>
  <resources>
    <name>ЛогистическийБрейк</name>
    <type>
      <types>CatalogRef.ЛогистическиеБрейки</types>
    </type>
  </resources>
  <resources>
    <name>Доставка</name>
    <type>
      <types>BusinessProcessRef.новаМестнаяДоставка</types>
    </type>
  </resources>
  <resources>
    <name>Смена</name>
    <type>
      <types>CatalogRef.Смены</types>
    </type>
  </resources>
  <resources>
    <name>Широта</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>Долгота</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>20</precision>
        <scale>13</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>КодИдентификацииКлиента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПолучательЗаказа</name>
    <type>
      <types>CatalogRef.ПолучателиЗаказов</types>
    </type>
  </resources>
  <resources>
    <name>ТребуетсяПредъявлениеУдостоверяющегоДокумента</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифРасчетаСтоимостиДоставки</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>11</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>НегабаритныйЗаказ</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ПодписаниеИВозвратСопрДокументов</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ВнешнийОператорМаршрутизации</name>
    <type>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </resources>
  <resources>
    <name>Агрегатор</name>
    <type>
      <types>CatalogRef.Маркетплейсы</types>
    </type>
  </resources>
  <resources>
    <name>ТарификацияПоОбъемномуВесу</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТарифицируемыйОбъемныйВес</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>3</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПунктПВЗ</name>
    <type>
      <types>CatalogRef.ПунктыПВЗ</types>
    </type>
  </resources>
  <resources>
    <name>УровеньОбслуживанияЗаказа</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </resources>
  <resources>
    <name>СсылкаНаОтслеживание</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>20</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаСозданияЗаказа</name>
    <type>
      <types>Date</types>
    </type>
  </resources>
  <resources>
    <name>ГабаритнаяХарактеристикаОпределенияЛогБрейка</name>
    <type>
      <types>EnumRef.ГабаритныеХарактеристикиЗаказа</types>
    </type>
  </resources>
  <dimensions>
    <name>Заказ</name>
    <type>
      <types>DocumentRef.РеализацияТоваровУслуг</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/InformationRegisters/КонтактнаяИнформация/КонтактнаяИнформация.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>КонтактнаяИнформация</name>
  <resources>
    <name>Представление</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Поле1</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле2</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле3</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле4</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле5</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле6</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле7</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле8</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле9</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Поле10</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>ЗначениеПоУмолчанию</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ТипДома</name>
    <type>
      <types>EnumRef.ТипыДомов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКорпуса</name>
    <type>
      <types>EnumRef.ТипыКорпусов</types>
    </type>
  </resources>
  <resources>
    <name>ТипКвартиры</name>
    <type>
      <types>EnumRef.ТипыКвартир</types>
    </type>
  </resources>
  <dimensions>
    <name>Объект</name>
    <type>
      <types>CatalogRef.Организации</types>
      <types>CatalogRef.Пользователи</types>
      <types>CatalogRef.Контрагенты</types>
      <types>CatalogRef.КонтактныеЛица</types>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.КонтактныеЛицаКонтрагентов</types>
      <types>CatalogRef.ЛичныеКонтакты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Тип</name>
    <type>
      <types>EnumRef.ТипыКонтактнойИнформации</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Вид</name>
    <type>
      <types>CatalogRef.ВидыКонтактнойИнформации</types>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </dimensions>
</mdclass:InformationRegister>

EDT/УТ/src/Catalogs/ТипыОплат/ТипыОплат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ТипыОплат</name>
  <predefined>
    <items>
      <name>БезРасчетов</name>
      <description>Без расчетов</description>
    </items>
    <items>
      <name>БезналичныйРасчет</name>
      <description>Безналичный расчет</description>
    </items>
    <items>
      <name>ВКредит</name>
      <description>В кредит</description>
    </items>
    <items>
      <name>Наличные</name>
      <description>Наличные</description>
    </items>
    <items>
      <name>ОплатаDPD</name>
      <description>Оплата DPD</description>
    </items>
    <items>
      <name>ОплатаКартой</name>
      <description>Оплата картой</description>
    </items>
    <items>
      <name>ОплаченоВМагазине</name>
      <description>Оплачено в магазине</description>
    </items>
    <items>
      <name>СБП</name>
      <description>СБП</description>
    </items>
    <items>
      <name>Терминал</name>
      <description>Терминал</description>
    </items>
    <items>
      <name>ЯндексДеньги</name>
      <description>Яндекс Деньги</description>
    </items>
  </predefined>
  <attributes>
    <name>КодОплаты</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>2</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваров</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияУслуг</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>БезналичнаяОплата</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>СекцияТоваровНДС</name>
    <type>
      <types>CatalogRef.СекцияККМ</types>
    </type>
  </attributes>
  <attributes>
    <name>КодОплатыНаККМ</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

EDT/УТ/src/DataProcessors/ЗагрузкаВЯндексOauth/Forms/Форма/Module.bsl
Функция СформироватьКлиентов()
	
	
	
	
КонецФункции	

&НаСервере
Процедура ВыгрузитьНаСервере()
	// Задача № 2901 Справочники.ТипыОплат.БезРасчетов
	Запрос = Новый Запрос;
	Запрос.Текст = "ВЫБРАТЬ
	               |	новаМестнаяДоставка.Ссылка КАК новаМестнаяДоставка,
	               |	новаМестнаяДоставка.ТочкаПрибытия.Наименование КАК ОсновнаяТочка,
	               |	новаМестнаяДоставка.ВремяПрибытияС КАК ВремяПрибытияС,
	               |	новаМестнаяДоставка.ВремяПрибытияПо КАК ВремяПрибытияПо,
	               |	новаМестнаяДоставка.Дата КАК Дата,
	               |	новаЗадачаМестнойДоставки.Выполнена КАК Выполнена,
	               |	КатегорииДоставки2014.Ссылка КАК КатегорияДоставки,
	               |	КатегорииДоставки2014.ВесПоУмолчанию КАК ВесПоУмолчанию,
	               |	КатегорииДоставки2014.ОбъемПоУмолчанию КАК ОбъемПоУмолчанию,
	               |	КатегорииДоставки2014.КоличествоМинутНаРазгрузку КАК КоличествоМинутНаРазгрузку,
	               |	РеализацияТоваровУслуг.ВладелецТовара.Наименование КАК ИМ,
	               |	новаМестнаяДоставка.ТочкаПрибытия.Наименование КАК АдресИзЯндекса,
	               |	новаМестнаяДоставка.ТочкаПрибытия КАК ТочкаПрибытия,
	               |	КатегорииДоставки2014ПродолжительностьРазгрузкиПоКомитентам.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
	               |	РеализацияТоваровУслуг.Ссылка КАК Заказ,
	               |	РеализацияТоваровУслуг.ВладелецТовара.Код КАК КодИМ,
	               |	РеализацияТоваровУслуг.ВладелецТовара КАК ВладелецТовара,
	               |	РеализацияТоваровУслуг.СуммаДокумента КАК СуммаДокумента,
	               |	РеализацияТоваровУслуг.Контрагент КАК Контрагент,
	               |	РеализацияТоваровУслуг.Контрагент.Код КАК КонтрагентКод,
	               |	РеализацияТоваровУслуг.Комментарий КАК Комментарий,
	               |	ВЫБОР
	               |		КОГДА ТипыОплат.Ссылка = ЗНАЧЕНИЕ(справочник.типыоплат.Наличные)
	               |			ТОГДА ""cash""
	               |		КОГДА ТипыОплат.Ссылка = ЗНАЧЕНИЕ(справочник.типыоплат.Терминал)
	               |			ТОГДА ""card""
	               |		КОГДА ТипыОплат.Ссылка = ЗНАЧЕНИЕ(справочник.типыоплат.ОплаченоВМагазине) ИЛИ ТипыОплат.Ссылка = ЗНАЧЕНИЕ(справочник.типыоплат.БезРасчетов)
	               |			ТОГДА ""prepaid""
	               |		ИНАЧЕ ""card""
	               |	КОНЕЦ КАК payment_type_ТипОплаты,
	               |	ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК courier_id_ВодительКод,
	               |	ПривязкаМашинКРейсамСрезПоследних.Водитель.Наименование КАК courier_name_ВодительНаименование,
	               |	ПривязкаМашинКРейсамСрезПоследних.Водитель.Код КАК courier_number_ВодительКод,
	               |	ЕСТЬNULL(ТелефонныеАппаратыТранспортаСрезПоследних.ТА.Телефон, """") КАК courier_phone_ТАТелефон,
	               |	РеализацияТоваровУслуг.Телефон КАК customer_phone_Телефон,
	               |	РеализацияТоваровУслуг.ВладелецТовара.Код КАК partner_number
	               |ПОМЕСТИТЬ ВТ
	               |ИЗ
	               |	БизнесПроцесс.новаМестнаяДоставка КАК новаМестнаяДоставка
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Задача.новаЗадачаМестнойДоставки КАК новаЗадачаМестнойДоставки
	               |		ПО новаМестнаяДоставка.Ссылка = новаЗадачаМестнойДоставки.БизнесПроцесс
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.РеализацияТоваровУслуг КАК РеализацияТоваровУслуг
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014.ПродолжительностьРазгрузкиПоКомитентам КАК КатегорииДоставки2014ПродолжительностьРазгрузкиПоКомитентам
	               |			ПО РеализацияТоваровУслуг.ВладелецТовара = КатегорииДоставки2014ПродолжительностьРазгрузкиПоКомитентам.Комитент
	               |				И РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014ПродолжительностьРазгрузкиПоКомитентам.Ссылка.Категория
	               |			ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.КатегорииДоставки2014 КАК КатегорииДоставки2014
	               |			ПО РеализацияТоваровУслуг.КатегорияДоставки = КатегорииДоставки2014.Категория
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Справочник.ТипыОплат КАК ТипыОплат
	               |			ПО РеализацияТоваровУслуг.ТипОплаты = ТипыОплат.Код
	               |			ЛЕВОЕ СОЕДИНЕНИЕ Документ.Рейс.Заказы КАК РейсЗаказы
	               |				ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ПривязкаМашинКРейсам.СрезПоследних КАК ПривязкаМашинКРейсамСрезПоследних
	               |					ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ТелефонныеАппаратыТранспорта.СрезПоследних КАК ТелефонныеАппаратыТранспортаСрезПоследних
	               |					ПО ПривязкаМашинКРейсамСрезПоследних.Транспорт = ТелефонныеАппаратыТранспортаСрезПоследних.Транспорт
	               |				ПО РейсЗаказы.Ссылка = ПривязкаМашинКРейсамСрезПоследних.Рейс
	               |			ПО РеализацияТоваровУслуг.Ссылка = РейсЗаказы.Заказ
	               |		ПО новаМестнаяДоставка.Номер = РеализацияТоваровУслуг.Номер
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаГруз КАК новаГруз
	               |		ПО новаМестнаяДоставка.Груз = новаГруз.Ссылка
	               |ГДЕ
	               |	НЕ РеализацияТоваровУслуг.ПометкаУдаления
	               |	И РеализацияТоваровУслуг.Дата МЕЖДУ &ДатаНач И &ДатаКон
	               |	И РеализацияТоваровУслуг.СтатусИнтернетМагазина = 2
	               |	И НЕ ТелефонныеАппаратыТранспортаСрезПоследних.Период ЕСТЬ NULL
	               |	И ПривязкаМашинКРейсамСрезПоследних.Водитель.Код <> """"
	               |	И РеализацияТоваровУслуг.Контрагент.Код <> """"
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ
	               |	ВТ.АдресИзЯндекса КАК address_АдресИзЯндекса,
	               |	ВТ.СуммаДокумента КАК amount_СуммаДокумента,
	               |	ВТ.Комментарий КАК comments_Комментарий,
	               |	ВТ.Дата КАК date_Дата,
	               |	"""" КАК description,
	               |	ВТ.Заказ.Номер КАК id_НомерЗаказа,
	               |	ВТ.Заказ.Номер КАК number,
	               |	ВТ.payment_type_ТипОплаты КАК payment_type_ТипОплаты,
	               |	""confirmed"" КАК status,
	               |	ВТ.ВремяПрибытияС КАК time_interval_ВремяПрибытияС,
	               |	ВТ.ВремяПрибытияПо КАК time_interval_ВремяПрибытияПо,
	               |	ВЫБОР
	               |		КОГДА ВТ.новаМестнаяДоставка.Груз.Объем = 0
	               |			ТОГДА ВТ.Заказ.ОбъёмЗаказа
	               |		ИНАЧЕ ВТ.новаМестнаяДоставка.Груз.Объем
	               |	КОНЕЦ КАК volume_ГрузОбъем,
	               |	ВЫБОР
	               |		КОГДА ВТ.новаМестнаяДоставка.Груз.Вес = 0
	               |			ТОГДА ВТ.Заказ.ОбщийВес
	               |		ИНАЧЕ ВТ.новаМестнаяДоставка.Груз.Вес
	               |	КОНЕЦ КАК weight_ГрузВес,
	               |	ВТ.новаМестнаяДоставка КАК новаМестнаяДоставка,
	               |	ВТ.ОсновнаяТочка КАК ОсновнаяТочка,
	               |	ВТ.Выполнена КАК Выполнена,
	               |	ВТ.КатегорияДоставки КАК КатегорияДоставки,
	               |	ВТ.ВесПоУмолчанию КАК ВесПоУмолчанию,
	               |	ВТ.ОбъемПоУмолчанию КАК ОбъемПоУмолчанию,
	               |	ВТ.КоличествоМинутНаРазгрузку КАК КоличествоМинутНаРазгрузку,
	               |	ВТ.ИМ КАК ИМ,
	               |	ВТ.ТочкаПрибытия КАК ТочкаПрибытия,
	               |	ВТ.ПродолжительностьРазгрузки КАК ПродолжительностьРазгрузки,
	               |	ВТ.Заказ КАК Заказ,
	               |	ВТ.КодИМ КАК КодИМ,
	               |	ВТ.новаМестнаяДоставка.ОсновнойКонтрагент.Наименование КАК ОсновнойКонтрагентНаименование,
	               |	ВТ.новаМестнаяДоставка.Телефон КАК Телефон,
	               |	ЕСТЬNULL(ВТ.новаМестнаяДоставка.ТочкаПрибытия.Адрес.Широта, 0) КАК Широта,
	               |	ЕСТЬNULL(ВТ.новаМестнаяДоставка.ТочкаПрибытия.Адрес.Долгота, 0) КАК Долгота,
	               |	ВЫБОР
	               |		КОГДА ВТ.КодИМ = ""Shop_604""
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВТ.КодИМ = ""Shop_391""
	               |			ТОГДА ИСТИНА
	               |		КОГДА ВТ.ВладелецТовара.Родитель.ОсновнойМагазин.Код = ""Shop_234""
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ЭтоДоговор,
	               |	ВТ.Заказ.Комментарий КАК ЗаказКомментарий,
	               |	ДополнительныеПараметрыЗаказа.КОплатеКлиентом КАК КОплатеКлиентом,
	               |	ВТ.Заказ.УчитыватьИтогоКОплате КАК УчитыватьИтогоКОплате,
	               |	ВЫБОР
	               |		КОГДА ВТ.Заказ.ВладелецТовара.Код = ""Shop_601""
				   |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_752""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_441""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_604""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_234""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_202""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Код = ""Shop_227""
	               |				ИЛИ ВТ.Заказ.ВладелецТовара.Родитель.Код = ""Shop_1914""
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК КонтрагентПешихКурьеров,
	               |	ВЫБОР
	               |		КОГДА ВТ.Заказ.ВладелецТовара.Код = ""Shop_180""
	               |				И (ВТ.КатегорияДоставки = ЗНАЧЕНИЕ(справочник.КатегорииДоставки2014.МГТ1)
	               |					ИЛИ ВТ.КатегорияДоставки = ЗНАЧЕНИЕ(справочник.КатегорииДоставки2014.МГТ2)
	               |					ИЛИ ВТ.КатегорияДоставки = ЗНАЧЕНИЕ(справочник.КатегорииДоставки2014.СГТ1))
	               |			ТОГДА ИСТИНА
	               |		ИНАЧЕ ЛОЖЬ
	               |	КОНЕЦ КАК ПроектКораблик,
	               |	ВТ.Контрагент КАК Контрагент,
	               |	ВТ.courier_id_ВодительКод КАК courier_id_ВодительКод,
	               |	ВТ.courier_name_ВодительНаименование КАК courier_name_ВодительНаименование,
	               |	ВТ.courier_number_ВодительКод КАК courier_number_ВодительКод,
	               |	ВТ.courier_phone_ТАТелефон КАК courier_phone_ТАТелефон,
	               |	ВТ.АдресИзЯндекса КАК customer_address_АдресИзЯндекса,
	               |	"""" КАК customer_description,
	               |	ВТ.КонтрагентКод КАК customer_id_КонтрагентКод,
	               |	ВТ.Контрагент.Наименование КАК customer_name_КонтрагентНаименование,
	               |	ВТ.Контрагент.Код КАК customer_number_КонтрагентКод,
	               |	ВТ.customer_phone_Телефон КАК customer_phone_Телефон,
	               |	ВТ.ВладелецТовара КАК ВладелецТовара,
	               |	ВТ.partner_number КАК partner_number
	               |ПОМЕСТИТЬ ВТ_ЗапросИзВероута
	               |ИЗ
	               |	ВТ КАК ВТ
	               |		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Документ.новаГруз КАК новаГруз
	               |		ПО ВТ.новаМестнаяДоставка.Груз.Ссылка = новаГруз.Ссылка
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДополнительныеПараметрыЗаказа КАК ДополнительныеПараметрыЗаказа
	               |		ПО ВТ.Заказ.Ссылка = ДополнительныеПараметрыЗаказа.Заказ.Ссылка
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗапросИзВероута.courier_id_ВодительКод КАК courier_id_ВодительКод,
	               |	ВТ_ЗапросИзВероута.courier_name_ВодительНаименование КАК courier_name_ВодительНаименование,
	               |	ВТ_ЗапросИзВероута.courier_number_ВодительКод КАК courier_number_ВодительКод,
	               |	ВТ_ЗапросИзВероута.courier_phone_ТАТелефон КАК courier_phone_ТАТелефон
	               |ИЗ
	               |	ВТ_ЗапросИзВероута КАК ВТ_ЗапросИзВероута
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗапросИзВероута.customer_address_АдресИзЯндекса КАК customer_address_АдресИзЯндекса,
	               |	ВТ_ЗапросИзВероута.customer_description КАК customer_description,
	               |	ВТ_ЗапросИзВероута.customer_id_КонтрагентКод КАК customer_id_КонтрагентКод,
	               |	ВТ_ЗапросИзВероута.customer_name_КонтрагентНаименование КАК customer_name_КонтрагентНаименование,
	               |	ВТ_ЗапросИзВероута.customer_number_КонтрагентКод КАК customer_number_КонтрагентКод,
	               |	ВТ_ЗапросИзВероута.customer_phone_Телефон КАК customer_phone_Телефон
	               |ИЗ
	               |	ВТ_ЗапросИзВероута КАК ВТ_ЗапросИзВероута
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(Адрес.Представление КАК СТРОКА(1000)), """") КАК address,
	               |	"""" КАК description,
	               |	ВТ_ЗапросИзВероута.ВладелецТовара.Код КАК id,
	               |	ВТ_ЗапросИзВероута.ВладелецТовара.Наименование КАК name,
	               |	ВТ_ЗапросИзВероута.ВладелецТовара.Код КАК number,
	               |	ЕСТЬNULL(ВЫРАЗИТЬ(Телефоны.Представление КАК СТРОКА(50)), """") КАК phone
	               |ИЗ
	               |	ВТ_ЗапросИзВероута КАК ВТ_ЗапросИзВероута
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Адрес
	               |		ПО ВТ_ЗапросИзВероута.ВладелецТовара = Адрес.Объект
	               |			И (Адрес.Вид = &Адрес)
	               |		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.КонтактнаяИнформация КАК Телефоны
	               |		ПО ВТ_ЗапросИзВероута.ВладелецТовара = Телефоны.Объект
	               |			И (Телефоны.Вид = &Телефон)
	               |;
	               |
	               |////////////////////////////////////////////////////////////////////////////////
	               |ВЫБРАТЬ РАЗЛИЧНЫЕ
	               |	ВТ_ЗапросИзВероута.address_АдресИзЯндекса КАК address_АдресИзЯндекса,
	               |	ВТ_ЗапросИзВероута.amount_СуммаДокумента КАК amount_СуммаДокумента,
	               |	ВЫРАЗИТЬ(ВТ_ЗапросИзВероута.comments_Комментарий КАК СТРОКА(1000)) КАК comments_Комментарий,
	               |	ВТ_ЗапросИзВероута.date_Дата КАК date_Дата,
	               |	ВТ_ЗапросИзВероута.description КАК description,
	               |	ВТ_ЗапросИзВероута.id_НомерЗаказа КАК id_НомерЗаказа,
	               |	ВТ_ЗапросИзВероута.number КАК number,
	               |	ВТ_ЗапросИзВероута.payment_type_ТипОплаты КАК payment_type_ТипОплаты,
	               |	ВТ_ЗапросИзВероута.status КАК status,
	               |	ВТ_ЗапросИзВероута.time_interval_ВремяПрибытияС КАК time_interval_ВремяПрибытияС,
	               |	ВТ_ЗапросИзВероута.time_interval_ВремяПрибытияПо КАК time_interval_ВремяПрибытияПо,
	               |	ВТ_ЗапросИзВероута.volume_ГрузОбъем КАК volume_ГрузОбъем,
	               |	ВТ_ЗапросИзВероута.weight_ГрузВес КАК weight_ГрузВес,
	               |	ВТ_ЗапросИзВероута.courier_id_ВодительКод КАК courier_id_ВодительКод,
	               |	ВТ_ЗапросИзВероута.customer_id_КонтрагентКод КАК customer_id_КонтрагентКод,
	               |	ВТ_ЗапросИзВероута.partner_number КАК partner_number
	               |ИЗ
	               |	ВТ_ЗапросИзВероута КАК ВТ_ЗапросИзВероута";
	
	Попытка
		
		
		Запрос.УстановитьПараметр("ДатаНач", НачалоДня(Объект.Дата));
		Запрос.УстановитьПараметр("ДатаКон", КонецДня(Объект.Дата));
		Запрос.УстановитьПараметр("Адрес", Справочники.ВидыКонтактнойИнформации.ФактАдресКонтрагента);
		Запрос.УстановитьПараметр("Телефон", Справочники.ВидыКонтактнойИнформации.ТелефонКонтрагента);
		
		
		
		Результат = Запрос.ВыполнитьПакет();
		
		МассивКурьеров = Новый Массив;
		ВыборкаКурьеров = Результат[2].Выбрать();
		Пока ВыборкаКурьеров.Следующий() Цикл 
				
			
			МассивКурьеров.Добавить(Новый Структура("
			|id, 
			|name, 
			|number, 
			|phone", 
			ВыборкаКурьеров.courier_id_ВодительКод, 
			ВыборкаКурьеров.courier_name_ВодительНаименование, 
			ВыборкаКурьеров.courier_number_ВодительКод, 
			ВыборкаКурьеров.courier_phone_ТАТелефон));
			
			
			
		КонецЦикла;
		
		МассивКлиентов = Новый Массив;
		ВыборкаКлиентов = Результат[3].Выбрать();
		Пока ВыборкаКлиентов.Следующий() Цикл 
			
			МассивКлиентов.Добавить(Новый Структура("
			|address, 
			|description, 
			|id, 
			|name, 
			|number, 
			|phone", 
			СокрЛП(ВыборкаКлиентов.customer_address_АдресИзЯндекса), 
			СокрЛП(ВыборкаКлиентов.customer_description), 
			ВыборкаКлиентов.customer_id_КонтрагентКод, 
			СокрЛП(ВыборкаКлиентов.customer_name_КонтрагентНаименование),
			СокрЛП(ВыборкаКлиентов.customer_number_КонтрагентКод),
			СокрЛП(ВыборкаКлиентов.customer_phone_Телефон)
			));
			
		КонецЦикла;	
		
		МассивПартнеров = Новый Массив;
		ВыборкаПартнеров = Результат[4].Выбрать();
		Пока ВыборкаПартнеров.Следующий() Цикл 
			
			МассивПартнеров.Добавить(Новый Структура("
			|address, 
			|description, 
			|id, 
			|name, 
			|number, 
			|phone", 
			ВыборкаПартнеров.address, 
			ВыборкаПартнеров.description, 
			ВыборкаПартнеров.id, 
			ВыборкаПартнеров.name,
			ВыборкаПартнеров.number,
			ВыборкаПартнеров.phone));
			
		КонецЦикла;						
		
		МассивЗаказов = Новый Массив;
		ВыборкаЗаказов = Результат[5].Выбрать();
		Пока ВыборкаЗаказов.Следующий() Цикл 
			
			date_Дата = Формат(Год(ВыборкаЗаказов.date_Дата), "ЧГ=0") + "-" + Месяц(ВыборкаЗаказов.date_Дата) + "-" + День(ВыборкаЗаказов.date_Дата);
			Если ЗначениеЗаполнено(ВыборкаЗаказов.time_interval_ВремяПрибытияС) И  ЗначениеЗаполнено(ВыборкаЗаказов.time_interval_ВремяПрибытияПо) Тогда
				//[[11, 12]]
				МассивИнтервал = Новый Массив;
				//time_interval = "[[" + Час(ВыборкаЗаказов.time_interval_ВремяПрибытияС) + "," + Час(ВыборкаЗаказов.time_interval_ВремяПрибытияПо) + "]]";
				МассивИнтервал.Добавить(Час(ВыборкаЗаказов.time_interval_ВремяПрибытияС));
				МассивИнтервал.Добавить(Час(ВыборкаЗаказов.time_interval_ВремяПрибытияПо));
				
			Иначе
				
				time_interval = "";
				
				
			КонецЕсли;	
			
			МассивЗаказов.Добавить(Новый Структура("
			|address, 
			|amount, 
			|comments, 
			|date, 
			|description, 
			|id,
			|number,
			|payment_type,
			|status,
			|time_interval,
			|volume,
			|weight,
			|customer_number,
			|courier_number,
			|partner_number", 
			ВыборкаЗаказов.address_АдресИзЯндекса, 
			ВыборкаЗаказов.amount_СуммаДокумента,
			ВыборкаЗаказов.description,
			date_Дата,
			ВыборкаЗаказов.description,
			СокрЛ(ВыборкаЗаказов.id_НомерЗаказа),
			СокрП(ВыборкаЗаказов.number),
			ВыборкаЗаказов.payment_type_ТипОплаты,
			ВыборкаЗаказов.status,
			time_interval,
			ВыборкаЗаказов.volume_ГрузОбъем,
			ВыборкаЗаказов.weight_ГрузВес,
			СокрЛП(ВыборкаЗаказов.customer_id_КонтрагентКод),
			ВыборкаЗаказов.courier_id_ВодительКод, 
			ВыборкаЗаказов.partner_number
			));
			
			
		КонецЦикла;			
		
		Отказ = ВыгрузитьНаСервереМассив(МассивКурьеров, Объект.ПрефиксСервиса + "couriers-batch");
		Если Отказ Тогда
			Сообщить("Загрузка прервана");
			Возврат;
		КонецЕсли;	
		Отказ = ВыгрузитьНаСервереМассив(МассивКлиентов, Объект.ПрефиксСервиса + "customers-batch");
		Если Отказ Тогда
			Сообщить("Загрузка прервана");
			Возврат;
		КонецЕсли;
		Отказ = ВыгрузитьНаСервереМассив(МассивПартнеров, Объект.ПрефиксСервиса + "partners-batch");
		Если Отказ Тогда
			Сообщить("Загрузка прервана");
			Возврат;
		КонецЕсли;
		Отказ = ВыгрузитьНаСервереМассив(МассивЗаказов, Объект.ПрефиксСервиса + "orders-batch");
		
	Исключение
		
		Сообщить("Общая ошибка: " + ОписаниеОшибки());
		
	КонецПопытки;
	

	
КонецПроцедуры

&НаСервере
Функция ВыгрузитьНаСервереМассив(МассивДанных, ИмяСервиса)
	
	Защищенное = Истина;
	
	// Заголовок создадим в виде соответствия
	ЗаголовокЗапросаHTTP = Новый Соответствие();
	// Передаем в заголовках размер и тип данных на отправку
	ЗаголовокЗапросаHTTP.Вставить("Authorization",  "Auth AQAAAAAM_LGcAARYHV-Zma_bQEFplDBkd2Xlr-A");
	ЗаголовокЗапросаHTTP.Вставить("Content-Type", "application/json");
	// Получим временный файл — тело ответа POST запроса
	ФайлРезультат = ПолучитьИмяВременногоФайла(".txt");
	
	//https://yandex.ru/courier/api/v1/companies/7/couriers-batch
	HTTPConnect = Новый HTTPСоединение(Объект.ИмяСеревера,,,,,Защищенное);
	
	HTTPЗапрос = Новый HTTPЗапрос(ИмяСервиса, ЗаголовокЗапросаHTTP);
	
	МассивМассивовДанных = Новый Массив;
	Массив = Новый Массив;
	
	Сч = 1;
	
	Для Каждого СтрокаМассива Из МассивДанных Цикл 
		
		Если Сч > Объект.РазмерПорцииДанных = 10 Тогда
			
			МассивМассивовДанных.Добавить(Массив);
			Сч = 1;
			Массив = Новый Массив;
			
		КонецЕсли;	
		
		Массив.Добавить(СтрокаМассива);
		
		Сч = Сч + 1;
		
	КонецЦикла;	
	
	Если Сч > 1 Тогда
		
		МассивМассивовДанных.Добавить(Массив);

	КонецЕсли;	
	
	Сч = 1;
	
	Для Каждого ПорцияДанных Из МассивМассивовДанных  Цикл 
		
		ЗаписьJSON          = Новый ЗаписьJSON;
		ПараметрыЗаписиJSON = Новый ПараметрыЗаписиJSON(, Символы.Таб);
		ФайлТелаЗапроса = ПолучитьИмяВременногоФайла("txt");
		ЗаписьJSON.УстановитьСтроку(ПараметрыЗаписиJSON);

		
		Данные              = ПорцияДанных;
		
		ЗаписатьJSON(ЗаписьJSON, Данные, Новый НастройкиСериализацииJSON);
		СтрJSON_Курьеров = ЗаписьJSON.Закрыть();	
		
		HTTPЗапрос.УстановитьТелоИзСтроки(СтрJSON_Курьеров, КодировкаТекста.UTF8, ИспользованиеByteOrderMark.НеИспользовать); 
		
		Ответ = HTTPConnect.ОтправитьДляОбработки(HTTPЗапрос, ФайлРезультат);
		
		Отказ = Ложь;
		
		Порция = Сч; 
		
		Сообщить("Запись в " + ИмяСервиса + ". Порция: " + Порция + ". Количество " + ПорцияДанных.Количество());
		
		Сч = Сч + 1;
		
		Попытка
			
			Чтение = Новый ТекстовыйДокумент;
			Чтение.Прочитать(ФайлРезультат);
			Стр = Чтение.ПолучитьТекст();
			Сообщить(Стр);
			
		Исключение
			
			Сообщить("Ошибка чтения файла ответа" + ". Порция: " + Порция);

			Возврат Истина;
			
		КонецПопытки;
		
		Если Ответ.КодСостояния <> 200 Тогда
			
			Сообщить("Ошибка записи в " + ИмяСервиса + ". Порция: " + Порция + ". Код ошибки " + Ответ.КодСостояния);
			Возврат Истина;;
			
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат Ложь;

КонецФункции

&НаКлиенте
Процедура Выгрузить(Команда)
	ВыгрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Объект.Дата = ТекущаяДата();
	
	Объект.СерверСБалансером = Истина;
	
	Если Объект.СерверСБалансером Тогда
		Объект.ИмяСеревера = "courier.common.yandex.ru";
		Объект.ПрефиксСервиса = "/api/v1/companies/7/";
		Объект.РазмерПорцииДанных = 10000;
	Иначе 	
		Объект.ИмяСеревера = "yandex.ru";
		Объект.ПрефиксСервиса = "/courier/api/v1/companies/7/";		
		Объект.РазмерПорцииДанных = 10;
	КонецЕсли;	

	
КонецПроцедуры

&НаКлиенте
Процедура Настроить(Команда)
	
	ОткрытьФорму("Обработка.ЗагрузкаВЯндексOauth.Форма.ФормаНастройки", , ЭтаФорма);
	
КонецПроцедуры
